import os

username = os.environ['USERNAME']
password = os.environ['PASSWORD']
buy_seed_num = '1'
buy_flower_id = '1'

headers = {
    'Host': '49.235.244.110',
    'Origin': 'http://116.62.123.233',
    'Referer': 'http://116.62.123.233/3Gmfhy/h5/index.html',
    'User-Agent': 'Mozilla/5.0 (Linux; Android 6.0; Nexus 5 Build/MRA58N) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/69.0.3497.100 Mobile Safari/537.36',
}

seed_info = {'1': '野花', '3': '菊花', '5': '梅花', '7': '桃花', '9': '兰花', '11': '樱花', '13': '丁香', '16': '百合', '19': '玫瑰',
             '22': '芙蓉', '25': '郁金香', '28': '蔷薇花', '31': '夜来香', '34': '勿忘我', '37': '恋人絮语', '40': '虞美人', '43': '永恒鸢尾',
             '46': '曼陀罗', '49': '康乃馨', '52': '幻雪之恋', '55': '风信子', '58': '迎春花', '61': '桔梗花', '64': '海棠花', '67': '迷迭香',
             '70': '天兰葵', '73': '水仙花', '76': '羽叶莺萝', '79': '金鱼草', '82': '三色旋花', '2': '银野花', '4': '银菊花', '6': '银梅花',
             '8': '银桃花', '10': '银兰花', '12': '银樱花', '14': '银丁香', '15': '金丁香', '17': '银百合', '18': '金百合', '20': '银玫瑰',
             '21': '金玫瑰', '23': '银芙蓉', '24': '金芙蓉', '26': '银郁金香', '27': '金郁金香', '29': '银蔷薇花', '30': '金蔷薇花',
             '32': '银夜来香', '33': '金夜来香', '35': '银勿忘我', '36': '金勿忘我', '38': '银恋人絮语', '39': '金恋人絮语', '41': '银虞美人',
             '42': '金虞美人', '47': '银曼陀罗', '48': '金曼陀罗', '50': '银康乃馨', '51': '金康乃馨', '56': '银风信子', '57': '金风信子',
             '59': '银迎春花', '60': '金迎春花', '62': '银桔梗花', '63': '金桔梗花', '65': '银海棠花', '66': '金海棠花', '68': '银迷迭香',
             '69': '金迷迭香', '71': '银天兰葵', '72': '金天兰葵', '74': '银水仙花', '75': '金水仙花', '77': '银羽叶莺萝', '78': '金羽叶莺萝',
             '80': '银金鱼草', '81': '金金鱼草', '83': '银三色旋花', '84': '金三色旋花', '179': '银色寒冰幽兰', '180': '金色寒冰幽兰',
             '181': '银色心语花情', '182': '金色心语花情', '183': '银色烈焰焚情', '184': '金色烈焰焚情', '185': '银色清辉月韵', '186': '金色清辉月韵',
             '187': '银色国庆牡丹', '188': '金色国庆牡丹', '189': '银色大力神', '190': '金色大力神', '191': '孤独求败', '192': '单身万岁',
             '193': '荣誉银仙女', '194': '荣誉金仙女', '195': '银色友谊花', '196': '金色友谊花', '197': '银色梦幻圣诞', '198': '金色梦幻圣诞',
             '199': '银色亚运风情', '200': '金色亚运风情', '201': '银色祈福-心系雅安', '202': '金色祈福-心系雅安', '203': '银色开心小丑', '204': '金色开心小丑',
             '205': '银色一树繁花', '206': '金色一树繁花', '207': '银色岁岁芳华', '208': '金色岁岁芳华', '209': '银色宝石花', '210': '金色宝石花',
             '211': '银色幽灵花', '212': '金色幽灵花', '213': '银色玉粽袭香', '214': '金色玉粽袭香', '215': '银色暮盈霄花', '216': '金色暮盈霄花',
             '217': '幽灵南瓜花', '218': '夜魔南瓜花', '219': '银色岁月如歌', '220': '金色岁月如歌', '221': '银色花样年华', '222': '金色花样年华',
             '223': '银色水晶之恋', '224': '金色水晶之恋', '225': '银色蝴蝶兰', '226': '金色蝴蝶兰', '227': '银色奥运之花', '228': '金色奥运之花',
             '229': '银色心心相印', '230': '金色心心相印', '231': '银色水之精灵', '232': '金色水之精灵', '233': '银色圣诞之吻', '234': '金色圣诞之吻',
             '235': '银色步步高升', '236': '金色步步高升', '237': '银色大花蕙兰', '238': '金色大花蕙兰', '239': '银色校园寄语', '240': '金色校园寄语',
             '241': '银色风华正茂', '242': '金色风华正茂', '243': '银色秋暮夕月', '244': '金色秋暮夕月', '245': '银色雪花纷飞', '246': '金色雪花纷飞',
             '247': '银色青春颂歌', '248': '金色青春颂歌', '249': '银色荣耀岁月', '250': '金色荣耀岁月', '251': '银色辞旧迎新', '252': '金色辞旧迎新',
             '253': '银色月季', '254': '金色月季', '255': '银色金蛇狂舞', '256': '金色金蛇狂舞', '257': '银色君子兰', '258': '金色君子兰',
             '259': '银色曼珠沙华', '260': '金色曼珠沙华', '261': '银色冰郁心兰', '262': '金色冰郁心兰', '263': '银色杜鹃花', '264': '金色杜鹃花',
             '265': '银色蓝色妖姬', '266': '金色蓝色妖姬', '267': '银色香槟玫瑰', '268': '金色香槟玫瑰', '269': '银色银芽柳', '270': '金色银芽柳',
             '271': '银色陌上花开', '272': '金色陌上花开', '273': '银色粉花凌霄', '274': '金色粉花凌霄', '275': '银色香水百合', '276': '金色香水百合',
             '277': '银色家园守望花', '278': '金色家园守望花', '279': '银色七彩玫瑰', '280': '金色七彩玫瑰', '281': '银色荷花', '282': '金色荷花',
             '283': '银色桂花', '284': '金色桂花', '285': '银色垂丝海棠', '286': '金色垂丝海棠', '287': '银色盛世中华', '288': '金色盛世中华',
             '289': '银色山茶花', '290': '金色山茶花', '291': '银色满天星', '292': '金色满天星', '293': '银色梦幻薰衣草', '294': '金色梦幻薰衣草',
             '295': '银色茉莉花', '296': '金色茉莉花', '297': '银色白羊花', '298': '金色白羊花', '299': '银色金牛花', '300': '金色金牛花',
             '301': '银色双子花', '302': '金色双子花', '303': '银色巨蟹花', '304': '金色巨蟹花', '305': '银色狮子花', '306': '金色狮子花',
             '307': '银色处女花', '308': '金色处女花', '309': '银色天秤花', '310': '金色天秤花', '311': '银色天蝎花', '312': '金色天蝎花',
             '313': '银色射手花', '314': '金色射手花', '315': '银色摩羯花', '316': '金色摩羯花', '317': '银色水瓶花', '318': '金色水瓶花',
             '319': '银色双鱼花', '320': '金色双鱼花', '321': '银色暗夜幽香', '322': '金色暗夜幽香', '323': '银色龙血花', '324': '金色龙血花',
             '325': '银色字母花Y', '326': '银色字母花X', '327': '银色字母花L', '328': '银色字母花N', '329': '银色字母花I', '330': '银色字母花A',
             '331': '银色字母花E', '332': '银色字母花U', '333': '银色字母花M', '334': '银色字母花V', '335': '银色字母花O', '336': '银色字母花S',
             '337': '银色字母花W', '338': '银色字母花R', '339': '金色字母花YEAR', '340': '金色字母花AI', '341': '金色字母花LOVE',
             '342': '银色纯恋蜜语', '343': '金色纯恋蜜语', '344': '银色精之风云', '345': '银色武之王者', '346': '银色堂之魅武', '347': '璀璨星空'}

base_url = 'http://49.235.244.110/mfhy/'
login_url = 'sysUser/login'  # 登录
sign_url = 'gardenInfo/sign'  # 签到
gardenInfo_url = 'gardenInfo/get'  # 花园信息
flowerpot_url = 'flowerpot/get'  # 花盆信息
oneOperation_url = 'flowerpot/oneOperation'  # 一键操作
oneHarvestFlower_url = 'flowerpot/oneHarvestFlower'  # 一键收获
knapsack_url = 'knapsack/get'  # 背包信息
sow_url = 'flowerpot/sow'  # 种植
add_url = 'knapsack/add'  # 购买种子
getMyFriends_url = 'friendC/getMyFriends'  # 获取好友列表
getFriendsPot_url = 'friendGardenInfo/getPot'  # 获取好友花盆信息
getFriendsGardenInfo_url = 'friendGardenInfo/getGardenInfo'  # 获取好友花园信息
helpFriendOperation_url = 'flowerpot/helpFriendOperation'  # 帮助好友
getSeedInfo_url = 'composite/get'  # 获取商店花种信息
extractFlower_url = 'flowerpot/extractFlower'  # 偷花
